<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Map.jsp</title>
<script src="http://code.jquery.com/jquery-latest.js"></script> 
<%@ include file="../../main/Header.jsp"%>
<link rel="stylesheet" href="resources/css/style.css?ver=1">

<script type="text/javascript"
	src="//dapi.kakao.com/v2/maps/sdk.js?appkey=e9b8314301529a33db2e3f1e889eb001&libraries=services,clusterer">	
</script>
<style type="text/css">
.info-title {
    display: block;
    text-align: center;
    line-height:30px;
    width: 200px;
    height: 30px;
}
</style>
</head>
<body>

<h1>생활인구분석</h1>
<br>
<h3>지도를 확대해 행정구역을 클릭하세요 <i class="fa-solid fa-arrow-pointer"></i></h3>
<hr>

	<table>
		<tr>
			<td>주소 검색 </td>
			<td><input type="text" name="detailAddress" id="address"></td>
			<td><button type="button" id="searchBtn">검색</button></td>
		</tr>	
	</table>

	<div id="map" style="width: 100%; height: 500px;"></div>
	<!-- 검색창 -->
	
	<!-- 다음지도 띄우기 -->
	<script type="text/javascript"
		src="//dapi.kakao.com/v2/maps/sdk.js?appkey=eef03eabb1ab19e0ded35169777e6b7f&libraries=services,clusterer">
	</script>
	
	<script>
	
    var map = new kakao.maps.Map(document.getElementById('map'), {
        center : new kakao.maps.LatLng(37.57002838826, 126.97962084516),
        level : 9 // 지도의 확대 레벨
    });
    
    var clusterer = new kakao.maps.MarkerClusterer({
        map: map, 
  		averageCenter: true,  
        minLevel: 8 ,
        disableClickZoom: true
    });
    
    var data = {
      "positions" : [
  	 		 {
    		  "address_code": 11110530,
    		  "address": "종로구 사직동",
    		  "lat": "37.5761869658796",
    		  "lng": "126.968846056089"
    		 },
    		 {
    		  "address_code": 11110540,
    		  "address": "종로구 삼청동",
    		  "lat": "37.584997782564",
    		  "lng": "126.981758302922"
    		 },
    		 {
    		  "address_code": 11110550,
    		  "address": "종로구 부암동",
    		  "lat": "37.5924142953538",
    		  "lng": "126.964061015983"
    		 },
    		 {
    		  "address_code": 11110560,
    		  "address": "종로구 평창동",
    		  "lat": "37.6063916960376",
    		  "lng": "126.968357810931"
    		 },
    		 {
    		  "address_code": 11110570,
    		  "address": "종로구 무악동",
    		  "lat": "37.5759854736855",
    		  "lng": "126.958245677349"
    		 },
    		 {
    		  "address_code": 11110580,
    		  "address": "종로구 교남동",
    		  "lat": "37.5683831622413",
    		  "lng": "126.964634002163"
    		 },
    		 {
    		  "address_code": 11110600,
    		  "address": "종로구 가회동",
    		  "lat": "37.5800968068428",
    		  "lng": "126.984784487479"
    		 },
    		 {
    		  "address_code": 11110615,
    		  "address": "종로구 종로1.2.3.4가동",
    		  "lat": "37.5744355396607",
    		  "lng": "126.990287260844"
    		 },
    		 {
    		  "address_code": 11110630,
    		  "address": "종로구 종로5.6가동",
    		  "lat": "37.5720319758375",
    		  "lng": "127.005071290563"
    		 },
    		 {
    		  "address_code": 11110640,
    		  "address": "종로구 이화동",
    		  "lat": "37.5769946840179",
    		  "lng": "127.004338052474"
    		 },
    		 {
    		  "address_code": 11110670,
    		  "address": "종로구 창신1동",
    		  "lat": "37.5707371209357",
    		  "lng": "127.016368212448"
    		 },
    		 {
    		  "address_code": 11110680,
    		  "address": "종로구 창신2동",
    		  "lat": "37.5744822903225",
    		  "lng": "127.010871935331"
    		 },
    		 {
    		  "address_code": 11110690,
    		  "address": "종로구 창신3동",
    		  "lat": "37.5778515523904",
    		  "lng": "127.015038452312"
    		 },
    		 {
    		  "address_code": 11110700,
    		  "address": "종로구 숭인1동",
    		  "lat": "37.5778010184559",
    		  "lng": "127.015640704357"
    		 },
    		 {
    		  "address_code": 11110710,
    		  "address": "종로구 숭인2동",
    		  "lat": "37.5748775396925",
    		  "lng": "127.01996896628"
    		 },
    		 {
    		  "address_code": 11110515,
    		  "address": "종로구 청운효자동",
    		  "lat": "37.5841161738354",
    		  "lng": "126.97064969123"
    		 },
    		 {
    		  "address_code": 11110650,
    		  "address": "종로구 혜화동",
    		  "lat": "37.5868624440018",
    		  "lng": "127.00060686405"
    		 },
    		 {
    		  "address_code": 11140520,
    		  "address": "중구 소공동",
    		  "lat": "37.5638997702148",
    		  "lng": "126.97979400965"
    		 },
    		 {
    		  "address_code": 11140540,
    		  "address": "중구 회현동",
    		  "lat": "37.5572935857078",
    		  "lng": "126.97935667015"
    		 },
    		 {
    		  "address_code": 11140550,
    		  "address": "중구 명동",
    		  "lat": "37.5600479851241",
    		  "lng": "126.985811715466"
    		 },
    		 {
    		  "address_code": 11140570,
    		  "address": "중구 필동",
    		  "lat": "37.5601640832368",
    		  "lng": "126.995599542438"
    		 },
    		 {
    		  "address_code": 11140580,
    		  "address": "중구 장충동",
    		  "lat": "37.5619118374184",
    		  "lng": "127.007859437008"
    		 },
    		 {
    		  "address_code": 11140590,
    		  "address": "중구 광희동",
    		  "lat": "37.5644311770078",
    		  "lng": "127.005052665365"
    		 },
    		 {
    		  "address_code": 11140605,
    		  "address": "중구 을지로동",
    		  "lat": "37.5666978745898",
    		  "lng": "126.991352255144"
    		 },
    		 {
    		  "address_code": 11140650,
    		  "address": "중구 신당5동",
    		  "lat": "37.5651320352657",
    		  "lng": "127.021876978157"
    		 },
    		 {
    		  "address_code": 11140670,
    		  "address": "중구 황학동",
    		  "lat": "37.5674999372119",
    		  "lng": "127.021415848975"
    		 },
    		 {
    		  "address_code": 11140680,
    		  "address": "중구 중림동",
    		  "lat": "37.5591682266788",
    		  "lng": "126.966186646494"
    		 },
    		 {
    		  "address_code": 11140615,
    		  "address": "중구 신당동",
    		  "lat": "37.5620157313145",
    		  "lng": "127.014442188261"
    		 },
    		 {
    		  "address_code": 11140625,
    		  "address": "중구 다산동",
    		  "lat": "37.5543182024144",
    		  "lng": "127.008302272338"
    		 },
    		 {
    		  "address_code": 11140635,
    		  "address": "중구 약수동",
    		  "lat": "37.5524332632787",
    		  "lng": "127.009003709806"
    		 },
    		 {
    		  "address_code": 11140645,
    		  "address": "중구 청구동",
    		  "lat": "37.5570313818504",
    		  "lng": "127.014717375081"
    		 },
    		 {
    		  "address_code": 11140665,
    		  "address": "중구 동화동",
    		  "lat": "37.5599859709471",
    		  "lng": "127.019430780665"
    		 },
    		 {
    		  "address_code": 11170510,
    		  "address": "용산구 후암동",
    		  "lat": "37.5486798277288",
    		  "lng": "126.978150463736"
    		 },
    		 {
    		  "address_code": 11170520,
    		  "address": "용산구 용산2가동",
    		  "lat": "37.5461329427321",
    		  "lng": "126.985569929155"
    		 },
    		 {
    		  "address_code": 11170530,
    		  "address": "용산구 남영동",
    		  "lat": "37.5430061454347",
    		  "lng": "126.973322683547"
    		 },
    		 {
    		  "address_code": 11170570,
    		  "address": "용산구 원효로2동",
    		  "lat": "37.5343604221088",
    		  "lng": "126.951530188917"
    		 },
    		 {
    		  "address_code": 11170580,
    		  "address": "용산구 효창동",
    		  "lat": "37.5424588083351",
    		  "lng": "126.9618988792"
    		 },
    		 {
    		  "address_code": 11170590,
    		  "address": "용산구 용문동",
    		  "lat": "37.537700864015",
    		  "lng": "126.959891817892"
    		 },
    		 {
    		  "address_code": 11170630,
    		  "address": "용산구 이촌1동",
    		  "lat": "37.5213965319056",
    		  "lng": "126.973316804703"
    		 },
    		 {
    		  "address_code": 11170640,
    		  "address": "용산구 이촌2동",
    		  "lat": "37.5262598665623",
    		  "lng": "126.954675898191"
    		 },
    		 {
    		  "address_code": 11170650,
    		  "address": "용산구 이태원1동",
    		  "lat": "37.5325069970313",
    		  "lng": "126.99509883212"
    		 },
    		 {
    		  "address_code": 11170660,
    		  "address": "용산구 이태원2동",
    		  "lat": "37.5419095312042",
    		  "lng": "126.990182855047"
    		 },
    		 {
    		  "address_code": 11170690,
    		  "address": "용산구 서빙고동",
    		  "lat": "37.5204623812777",
    		  "lng": "126.994638088433"
    		 },
    		 {
    		  "address_code": 11170700,
    		  "address": "용산구 보광동",
    		  "lat": "37.526272167319",
    		  "lng": "127.000171956489"
    		 },
    		 {
    		  "address_code": 11170555,
    		  "address": "용산구 청파동",
    		  "lat": "37.5454308035402",
    		  "lng": "126.969863704612"
    		 },
    		 {
    		  "address_code": 11170560,
    		  "address": "용산구 원효로1동",
    		  "lat": "37.5373284451336",
    		  "lng": "126.967712666408"
    		 },
    		 {
    		  "address_code": 11170625,
    		  "address": "용산구 한강로동",
    		  "lat": "37.5281386091259",
    		  "lng": "126.969114940356"
    		 },
    		 {
    		  "address_code": 11170685,
    		  "address": "용산구 한남동",
    		  "lat": "37.53462985578",
    		  "lng": "127.000552132438"
    		 },
    		 {
    		  "address_code": 11200520,
    		  "address": "성동구 왕십리2동",
    		  "lat": "37.5617963072272",
    		  "lng": "127.030994021909"
    		 },
    		 {
    		  "address_code": 11200540,
    		  "address": "성동구 마장동",
    		  "lat": "37.5663795479871",
    		  "lng": "127.045325760782"
    		 },
    		 {
    		  "address_code": 11200550,
    		  "address": "성동구 사근동",
    		  "lat": "37.5614997515695",
    		  "lng": "127.045327331714"
    		 },
    		 {
    		  "address_code": 11200560,
    		  "address": "성동구 행당1동",
    		  "lat": "37.5585043841658",
    		  "lng": "127.036203372396"
    		 },
    		 {
    		  "address_code": 11200570,
    		  "address": "성동구 행당2동",
    		  "lat": "37.558264821905",
    		  "lng": "127.0293401659"
    		 },
    		 {
    		  "address_code": 11200580,
    		  "address": "성동구 응봉동",
    		  "lat": "37.5531604882762",
    		  "lng": "127.033416807797"
    		 },
    		 {
    		  "address_code": 11200590,
    		  "address": "성동구 금호1가동",
    		  "lat": "37.5548499013662",
    		  "lng": "127.021643100245"
    		 },
    		 {
    		  "address_code": 11200620,
    		  "address": "성동구 금호4가동",
    		  "lat": "37.547191274357",
    		  "lng": "127.022401326841"
    		 },
    		 {
    		  "address_code": 11200650,
    		  "address": "성동구 성수1가1동",
    		  "lat": "37.5420797008055",
    		  "lng": "127.049651600525"
    		 },
    		 {
    		  "address_code": 11200660,
    		  "address": "성동구 성수1가2동",
    		  "lat": "37.5463633733528",
    		  "lng": "127.044313307763"
    		 },
    		 {
    		  "address_code": 11200670,
    		  "address": "성동구 성수2가1동",
    		  "lat": "37.5395549767236",
    		  "lng": "127.054035594083"
    		 },
    		 {
    		  "address_code": 11200690,
    		  "address": "성동구 성수2가3동",
    		  "lat": "37.5482184239099",
    		  "lng": "127.055250421934"
    		 },
    		 {
    		  "address_code": 11200720,
    		  "address": "성동구 송정동",
    		  "lat": "37.5545322586261",
    		  "lng": "127.069569072089"
    		 },
    		 {
    		  "address_code": 11200790,
    		  "address": "성동구 용답동",
    		  "lat": "37.5640758244217",
    		  "lng": "127.055579052769"
    		 },
    		 {
    		  "address_code": 11200535,
    		  "address": "성동구 왕십리도선동",
    		  "lat": "37.5678811410708",
    		  "lng": "127.025531625263"
    		 },
    		 {
    		  "address_code": 11200615,
    		  "address": "성동구 금호2.3가동",
    		  "lat": "37.5532931077204",
    		  "lng": "127.020918361398"
    		 },
    		 {
    		  "address_code": 11200645,
    		  "address": "성동구 옥수동",
    		  "lat": "37.5435886378545",
    		  "lng": "127.013438338877"
    		 },
    		 {
    		  "address_code": 11215710,
    		  "address": "광진구 화양동",
    		  "lat": "37.5464762611364",
    		  "lng": "127.071367614735"
    		 },
    		 {
    		  "address_code": 11215730,
    		  "address": "광진구 군자동",
    		  "lat": "37.5554765598174",
    		  "lng": "127.075350846159"
    		 },
    		 {
    		  "address_code": 11215740,
    		  "address": "광진구 중곡1동",
    		  "lat": "37.5606740001389",
    		  "lng": "127.080082528537"
    		 },
    		 {
    		  "address_code": 11215750,
    		  "address": "광진구 중곡2동",
    		  "lat": "37.5602945934345",
    		  "lng": "127.081526307691"
    		 },
    		 {
    		  "address_code": 11215760,
    		  "address": "광진구 중곡3동",
    		  "lat": "37.5687936902401",
    		  "lng": "127.080208942193"
    		 },
    		 {
    		  "address_code": 11215770,
    		  "address": "광진구 중곡4동",
    		  "lat": "37.5590779184911",
    		  "lng": "127.089447499249"
    		 },
    		 {
    		  "address_code": 11215780,
    		  "address": "광진구 능동",
    		  "lat": "37.5537792609499",
    		  "lng": "127.080536887135"
    		 },
    		 {
    		  "address_code": 11215850,
    		  "address": "광진구 구의1동",
    		  "lat": "37.5424122510284",
    		  "lng": "127.085675411153"
    		 },
    		 {
    		  "address_code": 11215860,
    		  "address": "광진구 구의2동",
    		  "lat": "37.5472276222658",
    		  "lng": "127.089940298223"
    		 },
    		 {
    		  "address_code": 11215870,
    		  "address": "광진구 구의3동",
    		  "lat": "37.5379818127006",
    		  "lng": "127.091961310776"
    		 },
    		 {
    		  "address_code": 11215810,
    		  "address": "광진구 광장동",
    		  "lat": "37.5468565308905",
    		  "lng": "127.103025712709"
    		 },
    		 {
    		  "address_code": 11215820,
    		  "address": "광진구 자양1동",
    		  "lat": "37.5345073783873",
    		  "lng": "127.082439566695"
    		 },
    		 {
    		  "address_code": 11215830,
    		  "address": "광진구 자양2동",
    		  "lat": "37.5288440921009",
    		  "lng": "127.084415425866"
    		 },
    		 {
    		  "address_code": 11215840,
    		  "address": "광진구 자양3동",
    		  "lat": "37.5338324938555",
    		  "lng": "127.072903328874"
    		 },
    		 {
    		  "address_code": 11215847,
    		  "address": "광진구 자양4동",
    		  "lat": "37.5340742469274",
    		  "lng": "127.066305179223"
    		 },
    		 {
    		  "address_code": 11230710,
    		  "address": "동대문구 회기동",
    		  "lat": "37.5907885967282",
    		  "lng": "127.05537245757"
    		 },
    		 {
    		  "address_code": 11230720,
    		  "address": "동대문구 휘경1동",
    		  "lat": "37.592967253631",
    		  "lng": "127.06579124432"
    		 },
    		 {
    		  "address_code": 11230730,
    		  "address": "동대문구 휘경2동",
    		  "lat": "37.5901076994928",
    		  "lng": "127.068614843098"
    		 },
    		 {
    		  "address_code": 11230705,
    		  "address": "동대문구 청량리동",
    		  "lat": "37.5862511095438",
    		  "lng": "127.047289719403"
    		 },
    		 {
    		  "address_code": 11230536,
    		  "address": "동대문구 용신동",
    		  "lat": "37.5758031741813",
    		  "lng": "127.03726228013"
    		 },
    		 {
    		  "address_code": 11230545,
    		  "address": "동대문구 제기동",
    		  "lat": "37.5831154639893",
    		  "lng": "127.037818414722"
    		 },
    		 {
    		  "address_code": 11230560,
    		  "address": "동대문구 전농1동",
    		  "lat": "37.5780230697115",
    		  "lng": "127.047705647167"
    		 },
    		 {
    		  "address_code": 11230570,
    		  "address": "동대문구 전농2동",
    		  "lat": "37.5780426774275",
    		  "lng": "127.060022639582"
    		 },
    		 {
    		  "address_code": 11230610,
    		  "address": "동대문구 답십리2동",
    		  "lat": "37.5673273970903",
    		  "lng": "127.061286310887"
    		 },
    		 {
    		  "address_code": 11230650,
    		  "address": "동대문구 장안1동",
    		  "lat": "37.5677895234587",
    		  "lng": "127.066439189872"
    		 },
    		 {
    		  "address_code": 11230660,
    		  "address": "동대문구 장안2동",
    		  "lat": "37.5784584817659",
    		  "lng": "127.070614728747"
    		 },
    		 {
    		  "address_code": 11230740,
    		  "address": "동대문구 이문1동",
    		  "lat": "37.5978219540466",
    		  "lng": "127.065505630651"
    		 },
    		 {
    		  "address_code": 11230750,
    		  "address": "동대문구 이문2동",
    		  "lat": "37.6033938926961",
    		  "lng": "127.065120950077"
    		 },
    		 {
    		  "address_code": 11230600,
    		  "address": "동대문구 답십리1동",
    		  "lat": "37.5697653601114",
    		  "lng": "127.050104641859"
    		 },
    		 {
    		  "address_code": 11260520,
    		  "address": "중랑구 면목2동",
    		  "lat": "37.5897876394401",
    		  "lng": "127.079031277935"
    		 },
    		 {
    		  "address_code": 11260540,
    		  "address": "중랑구 면목4동",
    		  "lat": "37.5746895999008",
    		  "lng": "127.085626342164"
    		 },
    		 {
    		  "address_code": 11260550,
    		  "address": "중랑구 면목5동",
    		  "lat": "37.5857905325323",
    		  "lng": "127.07948445767"
    		 },
    		 {
    		  "address_code": 11260570,
    		  "address": "중랑구 면목7동",
    		  "lat": "37.5790133780952",
    		  "lng": "127.086985272853"
    		 },
    		 {
    		  "address_code": 11260580,
    		  "address": "중랑구 상봉1동",
    		  "lat": "37.5998477528802",
    		  "lng": "127.087213355959"
    		 },
    		 {
    		  "address_code": 11260590,
    		  "address": "중랑구 상봉2동",
    		  "lat": "37.5929903188245",
    		  "lng": "127.080873522447"
    		 },
    		 {
    		  "address_code": 11260600,
    		  "address": "중랑구 중화1동",
    		  "lat": "37.6011714540386",
    		  "lng": "127.080674011197"
    		 },
    		 {
    		  "address_code": 11260610,
    		  "address": "중랑구 중화2동",
    		  "lat": "37.5993846556242",
    		  "lng": "127.079544212992"
    		 },
    		 {
    		  "address_code": 11260620,
    		  "address": "중랑구 묵1동",
    		  "lat": "37.6124136763105",
    		  "lng": "127.078484387323"
    		 },
    		 {
    		  "address_code": 11260630,
    		  "address": "중랑구 묵2동",
    		  "lat": "37.6060203697484",
    		  "lng": "127.07831458963"
    		 },
    		 {
    		  "address_code": 11260660,
    		  "address": "중랑구 망우3동",
    		  "lat": "37.5918986708538",
    		  "lng": "127.094917204218"
    		 },
    		 {
    		  "address_code": 11260680,
    		  "address": "중랑구 신내1동",
    		  "lat": "37.605874670309",
    		  "lng": "127.099496657031"
    		 },
    		 {
    		  "address_code": 11260690,
    		  "address": "중랑구 신내2동",
    		  "lat": "37.606246637442",
    		  "lng": "127.094178921329"
    		 },
    		 {
    		  "address_code": 11260565,
    		  "address": "중랑구 면목본동",
    		  "lat": "37.5872805191925",
    		  "lng": "127.087488538133"
    		 },
    		 {
    		  "address_code": 11260575,
    		  "address": "중랑구 면목3.8동",
    		  "lat": "37.5803715762431",
    		  "lng": "127.087661590766"
    		 },
    		 {
    		  "address_code": 11260655,
    		  "address": "중랑구 망우본동",
    		  "lat": "37.6005319691716",
    		  "lng": "127.101414648372"
    		 },
    		 {
    		  "address_code": 11290580,
    		  "address": "성북구 돈암1동",
    		  "lat": "37.6034197210043",
    		  "lng": "127.026386316288"
    		 },
    		 {
    		  "address_code": 11290590,
    		  "address": "성북구 돈암2동",
    		  "lat": "37.598016252053",
    		  "lng": "127.01058094036"
    		 },
    		 {
    		  "address_code": 11290600,
    		  "address": "성북구 안암동",
    		  "lat": "37.5858189680129",
    		  "lng": "127.021344106907"
    		 },
    		 {
    		  "address_code": 11290610,
    		  "address": "성북구 보문동",
    		  "lat": "37.5803802951265",
    		  "lng": "127.022823355231"
    		 },
    		 {
    		  "address_code": 11290620,
    		  "address": "성북구 정릉1동",
    		  "lat": "37.6014465243071",
    		  "lng": "127.016655780772"
    		 },
    		 {
    		  "address_code": 11290630,
    		  "address": "성북구 정릉2동",
    		  "lat": "37.6044925213612",
    		  "lng": "127.011139035883"
    		 },
    		 {
    		  "address_code": 11290640,
    		  "address": "성북구 정릉3동",
    		  "lat": "37.6089294464123",
    		  "lng": "127.004190410838"
    		 },
    		 {
    		  "address_code": 11290650,
    		  "address": "성북구 정릉4동",
    		  "lat": "37.6133765955269",
    		  "lng": "127.00699953542"
    		 },
    		 {
    		  "address_code": 11290660,
    		  "address": "성북구 길음1동",
    		  "lat": "37.6103983239179",
    		  "lng": "127.019502782008"
    		 },
    		 {
    		  "address_code": 11290685,
    		  "address": "성북구 길음2동",
    		  "lat": "37.6066955102482",
    		  "lng": "127.02731160121"
    		 },
    		 {
    		  "address_code": 11290715,
    		  "address": "성북구 월곡1동",
    		  "lat": "37.6105530868657",
    		  "lng": "127.035775560243"
    		 },
    		 {
    		  "address_code": 11290725,
    		  "address": "성북구 월곡2동",
    		  "lat": "37.6057915694888",
    		  "lng": "127.047886454933"
    		 },
    		 {
    		  "address_code": 11290760,
    		  "address": "성북구 장위1동",
    		  "lat": "37.6140390353238",
    		  "lng": "127.043732759303"
    		 },
    		 {
    		  "address_code": 11290770,
    		  "address": "성북구 장위2동",
    		  "lat": "37.6124055577355",
    		  "lng": "127.054518647757"
    		 },
    		 {
    		  "address_code": 11290780,
    		  "address": "성북구 장위3동",
    		  "lat": "37.6165491221701",
    		  "lng": "127.056605765307"
    		 },
    		 {
    		  "address_code": 11290525,
    		  "address": "성북구 성북동",
    		  "lat": "37.591046609396",
    		  "lng": "127.003274531869"
    		 },
    		 {
    		  "address_code": 11290555,
    		  "address": "성북구 삼선동",
    		  "lat": "37.5908367124635",
    		  "lng": "127.01467420945"
    		 },
    		 {
    		  "address_code": 11290575,
    		  "address": "성북구 동선동",
    		  "lat": "37.5939893305552",
    		  "lng": "127.020417940307"
    		 },
    		 {
    		  "address_code": 11290705,
    		  "address": "성북구 종암동",
    		  "lat": "37.5990602270307",
    		  "lng": "127.035212918853"
    		 },
    		 {
    		  "address_code": 11290810,
    		  "address": "성북구 석관동",
    		  "lat": "37.6129860183722",
    		  "lng": "127.0614007785"
    		 },
    		 {
    		  "address_code": 11305590,
    		  "address": "강북구 번1동",
    		  "lat": "37.6383483053371",
    		  "lng": "127.030155658216"
    		 },
    		 {
    		  "address_code": 11305600,
    		  "address": "강북구 번2동",
    		  "lat": "37.6276612500457",
    		  "lng": "127.035090468244"
    		 },
    		 {
    		  "address_code": 11305606,
    		  "address": "강북구 번3동",
    		  "lat": "37.6231790183561",
    		  "lng": "127.042745815786"
    		 },
    		 {
    		  "address_code": 11305610,
    		  "address": "강북구 수유1동",
    		  "lat": "37.6292195545748",
    		  "lng": "127.007105243262"
    		 },
    		 {
    		  "address_code": 11305620,
    		  "address": "강북구 수유2동",
    		  "lat": "37.6450249961346",
    		  "lng": "127.019765644211"
    		 },
    		 {
    		  "address_code": 11305630,
    		  "address": "강북구 수유3동",
    		  "lat": "37.6410058344713",
    		  "lng": "127.02393413051"
    		 },
    		 {
    		  "address_code": 11305534,
    		  "address": "강북구 삼양동",
    		  "lat": "37.625051949271",
    		  "lng": "127.019773947842"
    		 },
    		 {
    		  "address_code": 11305535,
    		  "address": "강북구 미아동",
    		  "lat": "37.6270831294022",
    		  "lng": "127.027060776679"
    		 },
    		 {
    		  "address_code": 11305545,
    		  "address": "강북구 송중동",
    		  "lat": "37.6161289893458",
    		  "lng": "127.033793824171"
    		 },
    		 {
    		  "address_code": 11305555,
    		  "address": "강북구 송천동",
    		  "lat": "37.6183082018069",
    		  "lng": "127.023867953194"
    		 },
    		 {
    		  "address_code": 11305575,
    		  "address": "강북구 삼각산동",
    		  "lat": "37.6151877663827",
    		  "lng": "127.020758996119"
    		 },
    		 {
    		  "address_code": 11305645,
    		  "address": "강북구 우이동",
    		  "lat": "37.6630390800114",
    		  "lng": "127.001890452891"
    		 },
    		 {
    		  "address_code": 11305660,
    		  "address": "강북구 인수동",
    		  "lat": "37.6414330477648",
    		  "lng": "127.010632416597"
    		 },
    		 {
    		  "address_code": 11320660,
    		  "address": "도봉구 쌍문1동",
    		  "lat": "37.6479970163536",
    		  "lng": "127.026075735308"
    		 },
    		 {
    		  "address_code": 11320670,
    		  "address": "도봉구 쌍문2동",
    		  "lat": "37.6579331438088",
    		  "lng": "127.038844558937"
    		 },
    		 {
    		  "address_code": 11320680,
    		  "address": "도봉구 쌍문3동",
    		  "lat": "37.6489660489947",
    		  "lng": "127.027934441938"
    		 },
    		 {
    		  "address_code": 11320681,
    		  "address": "도봉구 쌍문4동",
    		  "lat": "37.6564693155462",
    		  "lng": "127.028426823307"
    		 },
    		 {
    		  "address_code": 11320690,
    		  "address": "도봉구 방학1동",
    		  "lat": "37.6642357913395",
    		  "lng": "127.040679390304"
    		 },
    		 {
    		  "address_code": 11320700,
    		  "address": "도봉구 방학2동",
    		  "lat": "37.6682487842436",
    		  "lng": "127.034982623108"
    		 },
    		 {
    		  "address_code": 11320710,
    		  "address": "도봉구 방학3동",
    		  "lat": "37.659157939821",
    		  "lng": "127.028033457923"
    		 },
    		 {
    		  "address_code": 11320511,
    		  "address": "도봉구 창1동",
    		  "lat": "37.6497027515148",
    		  "lng": "127.035730874502"
    		 },
    		 {
    		  "address_code": 11320512,
    		  "address": "도봉구 창2동",
    		  "lat": "37.6413776828688",
    		  "lng": "127.035658904706"
    		 },
    		 {
    		  "address_code": 11320513,
    		  "address": "도봉구 창3동",
    		  "lat": "37.6381425244264",
    		  "lng": "127.042940196885"
    		 },
    		 {
    		  "address_code": 11320514,
    		  "address": "도봉구 창4동",
    		  "lat": "37.6599706183536",
    		  "lng": "127.045418866735"
    		 },
    		 {
    		  "address_code": 11320515,
    		  "address": "도봉구 창5동",
    		  "lat": "37.6563061158879",
    		  "lng": "127.043585282088"
    		 },
    		 {
    		  "address_code": 11320521,
    		  "address": "도봉구 도봉1동",
    		  "lat": "37.6786793222899",
    		  "lng": "127.043421525468"
    		 },
    		 {
    		  "address_code": 11320522,
    		  "address": "도봉구 도봉2동",
    		  "lat": "37.6697151863202",
    		  "lng": "127.046549203471"
    		 },
    		 {
    		  "address_code": 11350560,
    		  "address": "노원구 월계1동",
    		  "lat": "37.6198903481107",
    		  "lng": "127.063001311172"
    		 },
    		 {
    		  "address_code": 11350570,
    		  "address": "노원구 월계2동",
    		  "lat": "37.6324884457577",
    		  "lng": "127.050744895708"
    		 },
    		 {
    		  "address_code": 11350580,
    		  "address": "노원구 월계3동",
    		  "lat": "37.6210148773624",
    		  "lng": "127.069259441758"
    		 },
    		 {
    		  "address_code": 11350600,
    		  "address": "노원구 공릉2동",
    		  "lat": "37.6213085353565",
    		  "lng": "127.083296516416"
    		 },
    		 {
    		  "address_code": 11350611,
    		  "address": "노원구 하계1동",
    		  "lat": "37.6405462557669",
    		  "lng": "127.072581464765"
    		 },
    		 {
    		  "address_code": 11350612,
    		  "address": "노원구 하계2동",
    		  "lat": "37.6320400945188",
    		  "lng": "127.067978173503"
    		 },
    		 {
    		  "address_code": 11350619,
    		  "address": "노원구 중계본동",
    		  "lat": "37.6478284070694",
    		  "lng": "127.080307456815"
    		 },
    		 {
    		  "address_code": 11350621,
    		  "address": "노원구 중계1동",
    		  "lat": "37.652547829976",
    		  "lng": "127.077502189744"
    		 },
    		 {
    		  "address_code": 11350624,
    		  "address": "노원구 중계4동",
    		  "lat": "37.6587606815605",
    		  "lng": "127.077989166736"
    		 },
    		 {
    		  "address_code": 11350630,
    		  "address": "노원구 상계1동",
    		  "lat": "37.6799070536743",
    		  "lng": "127.054948904465"
    		 },
    		 {
    		  "address_code": 11350640,
    		  "address": "노원구 상계2동",
    		  "lat": "37.6574767214579",
    		  "lng": "127.067888030111"
    		 },
    		 {
    		  "address_code": 11350670,
    		  "address": "노원구 상계5동",
    		  "lat": "37.6629682202394",
    		  "lng": "127.069407204901"
    		 },
    		 {
    		  "address_code": 11350700,
    		  "address": "노원구 상계8동",
    		  "lat": "37.6667506745061",
    		  "lng": "127.051570675496"
    		 },
    		 {
    		  "address_code": 11350710,
    		  "address": "노원구 상계9동",
    		  "lat": "37.6645282589156",
    		  "lng": "127.063841458137"
    		 },
    		 {
    		  "address_code": 11350720,
    		  "address": "노원구 상계10동",
    		  "lat": "37.6612613757312",
    		  "lng": "127.060275446198"
    		 },
    		 {
    		  "address_code": 11350665,
    		  "address": "노원구 상계3.4동",
    		  "lat": "37.66125057554",
    		  "lng": "127.060252770712"
    		 },
    		 {
    		  "address_code": 11350695,
    		  "address": "노원구 상계6.7동",
    		  "lat": "37.66125057554",
    		  "lng": "127.060252770712"
    		 },
    		 {
    		  "address_code": 11350625,
    		  "address": "노원구 중계2.3동",
    		  "lat": "37.6525550467648",
    		  "lng": "127.077488598779"
    		 },
    		 {
    		  "address_code": 11350595,
    		  "address": "노원구 공릉1동",
    		  "lat": "37.6248214682346",
    		  "lng": "127.073848484316"
    		 },
    		 {
    		  "address_code": 11380510,
    		  "address": "은평구 녹번동",
    		  "lat": "37.6022161609652",
    		  "lng": "126.929919982801"
    		 },
    		 {
    		  "address_code": 11380520,
    		  "address": "은평구 불광1동",
    		  "lat": "37.6103587706933",
    		  "lng": "126.932086867815"
    		 },
    		 {
    		  "address_code": 11380551,
    		  "address": "은평구 갈현1동",
    		  "lat": "37.6236222973012",
    		  "lng": "126.916741681502"
    		 },
    		 {
    		  "address_code": 11380552,
    		  "address": "은평구 갈현2동",
    		  "lat": "37.6185545088607",
    		  "lng": "126.915845712352"
    		 },
    		 {
    		  "address_code": 11380560,
    		  "address": "은평구 구산동",
    		  "lat": "37.6117570303253",
    		  "lng": "126.910376186527"
    		 },
    		 {
    		  "address_code": 11380570,
    		  "address": "은평구 대조동",
    		  "lat": "37.6141899645266",
    		  "lng": "126.920825111083"
    		 },
    		 {
    		  "address_code": 11380580,
    		  "address": "은평구 응암1동",
    		  "lat": "37.6006969911171",
    		  "lng": "126.926786873558"
    		 },
    		 {
    		  "address_code": 11380590,
    		  "address": "은평구 응암2동",
    		  "lat": "37.5946147425878",
    		  "lng": "126.923074273439"
    		 },
    		 {
    		  "address_code": 11380631,
    		  "address": "은평구 신사1동",
    		  "lat": "37.5977927383187",
    		  "lng": "126.911769905815"
    		 },
    		 {
    		  "address_code": 11380632,
    		  "address": "은평구 신사2동",
    		  "lat": "37.5902361005581",
    		  "lng": "126.908196357025"
    		 },
    		 {
    		  "address_code": 11380640,
    		  "address": "은평구 증산동",
    		  "lat": "37.5843030609175",
    		  "lng": "126.907039772766"
    		 },
    		 {
    		  "address_code": 11380650,
    		  "address": "은평구 수색동",
    		  "lat": "37.5835205268469",
    		  "lng": "126.893672224269"
    		 },
    		 {
    		  "address_code": 11380690,
    		  "address": "은평구 진관동",
    		  "lat": "37.6349668825062",
    		  "lng": "126.92106591289"
    		 },
    		 {
    		  "address_code": 11380530,
    		  "address": "은평구 불광2동",
    		  "lat": "37.6265016239315",
    		  "lng": "126.92730531944"
    		 },
    		 {
    		  "address_code": 11380600,
    		  "address": "은평구 응암3동",
    		  "lat": "37.592241925144",
    		  "lng": "126.915734945869"
    		 },
    		 {
    		  "address_code": 11380625,
    		  "address": "은평구 역촌동",
    		  "lat": "37.6043976551681",
    		  "lng": "126.915123289569"
    		 },
    		 {
    		  "address_code": 11410520,
    		  "address": "서대문구 천연동",
    		  "lat": "37.5675017663096",
    		  "lng": "126.958422464555"
    		 },
    		 {
    		  "address_code": 11410620,
    		  "address": "서대문구 홍제1동",
    		  "lat": "37.587718166217",
    		  "lng": "126.94495136806"
    		 },
    		 {
    		  "address_code": 11410640,
    		  "address": "서대문구 홍제3동",
    		  "lat": "37.5937821789849",
    		  "lng": "126.949743382569"
    		 },
    		 {
    		  "address_code": 11410655,
    		  "address": "서대문구 홍제2동",
    		  "lat": "37.5861524257407",
    		  "lng": "126.94939073794"
    		 },
    		 {
    		  "address_code": 11410660,
    		  "address": "서대문구 홍은1동",
    		  "lat": "37.5989166778932",
    		  "lng": "126.947108251212"
    		 },
    		 {
    		  "address_code": 11410685,
    		  "address": "서대문구 홍은2동",
    		  "lat": "37.5801515443519",
    		  "lng": "126.934229091144"
    		 },
    		 {
    		  "address_code": 11410690,
    		  "address": "서대문구 남가좌1동",
    		  "lat": "37.5732734342748",
    		  "lng": "126.919786253545"
    		 },
    		 {
    		  "address_code": 11410700,
    		  "address": "서대문구 남가좌2동",
    		  "lat": "37.5784478485824",
    		  "lng": "126.923874309123"
    		 },
    		 {
    		  "address_code": 11410710,
    		  "address": "서대문구 북가좌1동",
    		  "lat": "37.5742792384463",
    		  "lng": "126.910185660454"
    		 },
    		 {
    		  "address_code": 11410720,
    		  "address": "서대문구 북가좌2동",
    		  "lat": "37.5815059808523",
    		  "lng": "126.911204951585"
    		 },
    		 {
    		  "address_code": 11410565,
    		  "address": "서대문구 충현동",
    		  "lat": "37.5648190388812",
    		  "lng": "126.954715932221"
    		 },
    		 {
    		  "address_code": 11410555,
    		  "address": "서대문구 북아현동",
    		  "lat": "37.5595652449812",
    		  "lng": "126.956901214305"
    		 },
    		 {
    		  "address_code": 11410585,
    		  "address": "서대문구 신촌동",
    		  "lat": "37.5651616940519",
    		  "lng": "126.93927687604"
    		 },
    		 {
    		  "address_code": 11410615,
    		  "address": "서대문구 연희동",
    		  "lat": "37.573910010416",
    		  "lng": "126.935230751932"
    		 },
    		 {
    		  "address_code": 11440590,
    		  "address": "마포구 용강동",
    		  "lat": "37.5422744939978",
    		  "lng": "126.942776042667"
    		 },
    		 {
    		  "address_code": 11440600,
    		  "address": "마포구 대흥동",
    		  "lat": "37.5498936438387",
    		  "lng": "126.943403941965"
    		 },
    		 {
    		  "address_code": 11440610,
    		  "address": "마포구 염리동",
    		  "lat": "37.5470619620455",
    		  "lng": "126.94565571696"
    		 },
    		 {
    		  "address_code": 11440630,
    		  "address": "마포구 신수동",
    		  "lat": "37.5470206619263",
    		  "lng": "126.935226865858"
    		 },
    		 {
    		  "address_code": 11440660,
    		  "address": "마포구 서교동",
    		  "lat": "37.5550949138085",
    		  "lng": "126.914613374473"
    		 },
    		 {
    		  "address_code": 11440680,
    		  "address": "마포구 합정동",
    		  "lat": "37.5516618139959",
    		  "lng": "126.911756414276"
    		 },
    		 {
    		  "address_code": 11440690,
    		  "address": "마포구 망원1동",
    		  "lat": "37.5555962174352",
    		  "lng": "126.905604188078"
    		 },
    		 {
    		  "address_code": 11440700,
    		  "address": "마포구 망원2동",
    		  "lat": "37.5603111702014",
    		  "lng": "126.902325054916"
    		 },
    		 {
    		  "address_code": 11440710,
    		  "address": "마포구 연남동",
    		  "lat": "37.5644776141887",
    		  "lng": "126.922023205508"
    		 },
    		 {
    		  "address_code": 11440720,
    		  "address": "마포구 성산1동",
    		  "lat": "37.5633862382561",
    		  "lng": "126.907889758423"
    		 },
    		 {
    		  "address_code": 11440730,
    		  "address": "마포구 성산2동",
    		  "lat": "37.5686561200209",
    		  "lng": "126.908997091451"
    		 },
    		 {
    		  "address_code": 11440740,
    		  "address": "마포구 상암동",
    		  "lat": "37.5783209050878",
    		  "lng": "126.894689433213"
    		 },
    		 {
    		  "address_code": 11440585,
    		  "address": "마포구 도화동",
    		  "lat": "37.541549712387",
    		  "lng": "126.949873511116"
    		 },
    		 {
    		  "address_code": 11440655,
    		  "address": "마포구 서강동",
    		  "lat": "37.5477468723034",
    		  "lng": "126.932030551178"
    		 },
    		 {
    		  "address_code": 11440565,
    		  "address": "마포구 공덕동",
    		  "lat": "37.550174347382",
    		  "lng": "126.960034513244"
    		 },
    		 {
    		  "address_code": 11440555,
    		  "address": "마포구 아현동",
    		  "lat": "37.5544832516732",
    		  "lng": "126.955903701632"
    		 },
    		 {
    		  "address_code": 11470510,
    		  "address": "양천구 목1동",
    		  "lat": "37.530353681952",
    		  "lng": "126.871138769506"
    		 },
    		 {
    		  "address_code": 11470520,
    		  "address": "양천구 목2동",
    		  "lat": "37.5461325995948",
    		  "lng": "126.871700041249"
    		 },
    		 {
    		  "address_code": 11470530,
    		  "address": "양천구 목3동",
    		  "lat": "37.5447333646534",
    		  "lng": "126.864455859678"
    		 },
    		 {
    		  "address_code": 11470540,
    		  "address": "양천구 목4동",
    		  "lat": "37.5324698274943",
    		  "lng": "126.868410752397"
    		 },
    		 {
    		  "address_code": 11470560,
    		  "address": "양천구 신월1동",
    		  "lat": "37.5328014029809",
    		  "lng": "126.831535897403"
    		 },
    		 {
    		  "address_code": 11470570,
    		  "address": "양천구 신월2동",
    		  "lat": "37.5249805841788",
    		  "lng": "126.84458121373"
    		 },
    		 {
    		  "address_code": 11470580,
    		  "address": "양천구 신월3동",
    		  "lat": "37.5336736083475",
    		  "lng": "126.829053899725"
    		 },
    		 {
    		  "address_code": 11470590,
    		  "address": "양천구 신월4동",
    		  "lat": "37.5246645746866",
    		  "lng": "126.84003869981"
    		 },
    		 {
    		  "address_code": 11470600,
    		  "address": "양천구 신월5동",
    		  "lat": "37.5385687248394",
    		  "lng": "126.827187102812"
    		 },
    		 {
    		  "address_code": 11470610,
    		  "address": "양천구 신월6동",
    		  "lat": "37.5180146978642",
    		  "lng": "126.845084326213"
    		 },
    		 {
    		  "address_code": 11470611,
    		  "address": "양천구 신월7동",
    		  "lat": "37.5218857814505",
    		  "lng": "126.834727873692"
    		 },
    		 {
    		  "address_code": 11470620,
    		  "address": "양천구 신정1동",
    		  "lat": "37.5185381615641",
    		  "lng": "126.854272909009"
    		 },
    		 {
    		  "address_code": 11470630,
    		  "address": "양천구 신정2동",
    		  "lat": "37.5192204259242",
    		  "lng": "126.870700918539"
    		 },
    		 {
    		  "address_code": 11470640,
    		  "address": "양천구 신정3동",
    		  "lat": "37.5151186039404",
    		  "lng": "126.854799875203"
    		 },
    		 {
    		  "address_code": 11470670,
    		  "address": "양천구 신정6동",
    		  "lat": "37.5170400866492",
    		  "lng": "126.864352127975"
    		 },
    		 {
    		  "address_code": 11470680,
    		  "address": "양천구 신정7동",
    		  "lat": "37.5143965008325",
    		  "lng": "126.859687680177"
    		 },
    		 {
    		  "address_code": 11470550,
    		  "address": "양천구 목5동",
    		  "lat": "37.5371799183102",
    		  "lng": "126.881717459292"
    		 },
    		 {
    		  "address_code": 11470650,
    		  "address": "양천구 신정4동",
    		  "lat": "37.5233657021762",
    		  "lng": "126.858698011461"
    		 },
    		 {
    		  "address_code": 11500510,
    		  "address": "강서구 염창동",
    		  "lat": "37.5537362431352",
    		  "lng": "126.870985348962"
    		 },
    		 {
    		  "address_code": 11500520,
    		  "address": "강서구 등촌1동",
    		  "lat": "37.5558415907104",
    		  "lng": "126.858921911462"
    		 },
    		 {
    		  "address_code": 11500530,
    		  "address": "강서구 등촌2동",
    		  "lat": "37.5426660086894",
    		  "lng": "126.862495249879"
    		 },
    		 {
    		  "address_code": 11500535,
    		  "address": "강서구 등촌3동",
    		  "lat": "37.5588805142741",
    		  "lng": "126.847924290465"
    		 },
    		 {
    		  "address_code": 11500590,
    		  "address": "강서구 화곡본동",
    		  "lat": "37.5440461638817",
    		  "lng": "126.847669275402"
    		 },
    		 {
    		  "address_code": 11500550,
    		  "address": "강서구 화곡2동",
    		  "lat": "37.5318155949568",
    		  "lng": "126.854495982486"
    		 },
    		 {
    		  "address_code": 11500560,
    		  "address": "강서구 화곡3동",
    		  "lat": "37.5425273892063",
    		  "lng": "126.838411865428"
    		 },
    		 {
    		  "address_code": 11500570,
    		  "address": "강서구 화곡4동",
    		  "lat": "37.5346271912574",
    		  "lng": "126.86087171755"
    		 },
    		 {
    		  "address_code": 11500591,
    		  "address": "강서구 화곡6동",
    		  "lat": "37.5518158458179",
    		  "lng": "126.850075253526"
    		 },
    		 {
    		  "address_code": 11500593,
    		  "address": "강서구 화곡8동",
    		  "lat": "37.5326259869176",
    		  "lng": "126.848362286981"
    		 },
    		 {
    		  "address_code": 11500603,
    		  "address": "강서구 가양1동",
    		  "lat": "37.5694972894278",
    		  "lng": "126.844728733334"
    		 },
    		 {
    		  "address_code": 11500604,
    		  "address": "강서구 가양2동",
    		  "lat": "37.5673721398151",
    		  "lng": "126.851257490922"
    		 },
    		 {
    		  "address_code": 11500605,
    		  "address": "강서구 가양3동",
    		  "lat": "37.5610584775856",
    		  "lng": "126.860537365324"
    		 },
    		 {
    		  "address_code": 11500611,
    		  "address": "강서구 발산1동",
    		  "lat": "37.5530979481593",
    		  "lng": "126.833264722295"
    		 },
    		 {
    		  "address_code": 11500620,
    		  "address": "강서구 공항동",
    		  "lat": "37.5588726032733",
    		  "lng": "126.810109136838"
    		 },
    		 {
    		  "address_code": 11500630,
    		  "address": "강서구 방화1동",
    		  "lat": "37.5703442238477",
    		  "lng": "126.817052873863"
    		 },
    		 {
    		  "address_code": 11500640,
    		  "address": "강서구 방화2동",
    		  "lat": "37.5667130007595",
    		  "lng": "126.80673880486"
    		 },
    		 {
    		  "address_code": 11500641,
    		  "address": "강서구 방화3동",
    		  "lat": "37.5787432109189",
    		  "lng": "126.813550033647"
    		 },
    		 {
    		  "address_code": 11500540,
    		  "address": "강서구 화곡1동",
    		  "lat": "37.5303934432115",
    		  "lng": "126.841601310694"
    		 },
    		 {
    		  "address_code": 11500615,
    		  "address": "강서구 우장산동",
    		  "lat": "37.5481974467964",
    		  "lng": "126.84179449484"
    		 },
    		 {
    		  "address_code": 11530510,
    		  "address": "구로구 신도림동",
    		  "lat": "37.5077809050367",
    		  "lng": "126.880610228674"
    		 },
    		 {
    		  "address_code": 11530520,
    		  "address": "구로구 구로1동",
    		  "lat": "37.493028299768",
    		  "lng": "126.875812024894"
    		 },
    		 {
    		  "address_code": 11530540,
    		  "address": "구로구 구로3동",
    		  "lat": "37.4873483040234",
    		  "lng": "126.890330632764"
    		 },
    		 {
    		  "address_code": 11530550,
    		  "address": "구로구 구로4동",
    		  "lat": "37.4916288000586",
    		  "lng": "126.889161943621"
    		 },
    		 {
    		  "address_code": 11530560,
    		  "address": "구로구 구로5동",
    		  "lat": "37.5001236666572",
    		  "lng": "126.889352949931"
    		 },
    		 {
    		  "address_code": 11530720,
    		  "address": "구로구 고척1동",
    		  "lat": "37.5003552584696",
    		  "lng": "126.862762866771"
    		 },
    		 {
    		  "address_code": 11530730,
    		  "address": "구로구 고척2동",
    		  "lat": "37.5067114574941",
    		  "lng": "126.858611784382"
    		 },
    		 {
    		  "address_code": 11530750,
    		  "address": "구로구 개봉2동",
    		  "lat": "37.490880097229",
    		  "lng": "126.856542943987"
    		 },
    		 {
    		  "address_code": 11530760,
    		  "address": "구로구 개봉3동",
    		  "lat": "37.4860041527514",
    		  "lng": "126.853852194023"
    		 },
    		 {
    		  "address_code": 11530770,
    		  "address": "구로구 오류1동",
    		  "lat": "37.4970933382635",
    		  "lng": "126.845050656227"
    		 },
    		 {
    		  "address_code": 11530780,
    		  "address": "구로구 오류2동",
    		  "lat": "37.4888579442969",
    		  "lng": "126.839504491085"
    		 },
    		 {
    		  "address_code": 11530790,
    		  "address": "구로구 수궁동",
    		  "lat": "37.4938815927114",
    		  "lng": "126.831478611978"
    		 },
    		 {
    		  "address_code": 11530595,
    		  "address": "구로구 가리봉동",
    		  "lat": "37.4825327471338",
    		  "lng": "126.889718085071"
    		 },
    		 {
    		  "address_code": 11530530,
    		  "address": "구로구 구로2동",
    		  "lat": "37.4913926941216",
    		  "lng": "126.883499417136"
    		 },
    		 {
    		  "address_code": 11530740,
    		  "address": "구로구 개봉1동",
    		  "lat": "37.5002655077752",
    		  "lng": "126.851146433462"
    		 },
    		 {
    		  "address_code": 11545510,
    		  "address": "금천구 가산동",
    		  "lat": "37.4768763179226",
    		  "lng": "126.891779471155"
    		 },
    		 {
    		  "address_code": 11545610,
    		  "address": "금천구 독산1동",
    		  "lat": "37.4702207575198",
    		  "lng": "126.897043384219"
    		 },
    		 {
    		  "address_code": 11545620,
    		  "address": "금천구 독산2동",
    		  "lat": "37.4661325181371",
    		  "lng": "126.899775480394"
    		 },
    		 {
    		  "address_code": 11545630,
    		  "address": "금천구 독산3동",
    		  "lat": "37.4751490651629",
    		  "lng": "126.903182137349"
    		 },
    		 {
    		  "address_code": 11545640,
    		  "address": "금천구 독산4동",
    		  "lat": "37.4675472948482",
    		  "lng": "126.902151967452"
    		 },
    		 {
    		  "address_code": 11545670,
    		  "address": "금천구 시흥1동",
    		  "lat": "37.4535392677414",
    		  "lng": "126.903250685753"
    		 },
    		 {
    		  "address_code": 11545680,
    		  "address": "금천구 시흥2동",
    		  "lat": "37.4495585471742",
    		  "lng": "126.914905255169"
    		 },
    		 {
    		  "address_code": 11545690,
    		  "address": "금천구 시흥3동",
    		  "lat": "37.440278387042",
    		  "lng": "126.905780873049"
    		 },
    		 {
    		  "address_code": 11545700,
    		  "address": "금천구 시흥4동",
    		  "lat": "37.4590450263751",
    		  "lng": "126.906195881185"
    		 },
    		 {
    		  "address_code": 11545710,
    		  "address": "금천구 시흥5동",
    		  "lat": "37.4507682074616",
    		  "lng": "126.908344469462"
    		 },
    		 {
    		  "address_code": 11560540,
    		  "address": "영등포구 여의동",
    		  "lat": "37.5176044401505",
    		  "lng": "126.934609800644"
    		 },
    		 {
    		  "address_code": 11560550,
    		  "address": "영등포구 당산1동",
    		  "lat": "37.5249733938379",
    		  "lng": "126.89738449562"
    		 },
    		 {
    		  "address_code": 11560560,
    		  "address": "영등포구 당산2동",
    		  "lat": "37.5310028334213",
    		  "lng": "126.897312879485"
    		 },
    		 {
    		  "address_code": 11560610,
    		  "address": "영등포구 양평1동",
    		  "lat": "37.5236784650184",
    		  "lng": "126.888241219879"
    		 },
    		 {
    		  "address_code": 11560620,
    		  "address": "영등포구 양평2동",
    		  "lat": "37.5377447245088",
    		  "lng": "126.89594587648"
    		 },
    		 {
    		  "address_code": 11560630,
    		  "address": "영등포구 신길1동",
    		  "lat": "37.5111452107739",
    		  "lng": "126.921413655672"
    		 },
    		 {
    		  "address_code": 11560650,
    		  "address": "영등포구 신길3동",
    		  "lat": "37.5073078884431",
    		  "lng": "126.907782268717"
    		 },
    		 {
    		  "address_code": 11560660,
    		  "address": "영등포구 신길4동",
    		  "lat": "37.5084350908834",
    		  "lng": "126.911373011399"
    		 },
    		 {
    		  "address_code": 11560670,
    		  "address": "영등포구 신길5동",
    		  "lat": "37.5016259275316",
    		  "lng": "126.90522432992"
    		 },
    		 {
    		  "address_code": 11560680,
    		  "address": "영등포구 신길6동",
    		  "lat": "37.498493766473",
    		  "lng": "126.919436578899"
    		 },
    		 {
    		  "address_code": 11560690,
    		  "address": "영등포구 신길7동",
    		  "lat": "37.5063735330339",
    		  "lng": "126.921477469472"
    		 },
    		 {
    		  "address_code": 11560700,
    		  "address": "영등포구 대림1동",
    		  "lat": "37.4954671376446",
    		  "lng": "126.905833713564"
    		 },
    		 {
    		  "address_code": 11560710,
    		  "address": "영등포구 대림2동",
    		  "lat": "37.4927542307884",
    		  "lng": "126.898256326744"
    		 },
    		 {
    		  "address_code": 11560720,
    		  "address": "영등포구 대림3동",
    		  "lat": "37.4983078602852",
    		  "lng": "126.898054282642"
    		 },
    		 {
    		  "address_code": 11560515,
    		  "address": "영등포구 영등포본동",
    		  "lat": "37.5146504855169",
    		  "lng": "126.909352273906"
    		 },
    		 {
    		  "address_code": 11560535,
    		  "address": "영등포구 영등포동",
    		  "lat": "37.5134118222975",
    		  "lng": "126.906168599588"
    		 },
    		 {
    		  "address_code": 11560585,
    		  "address": "영등포구 도림동",
    		  "lat": "37.5094388403259",
    		  "lng": "126.895944463887"
    		 },
    		 {
    		  "address_code": 11560605,
    		  "address": "영등포구 문래동",
    		  "lat": "37.5171112504907",
    		  "lng": "126.899485634762"
    		 },
    		 {
    		  "address_code": 11590520,
    		  "address": "동작구 노량진2동",
    		  "lat": "37.5085057900649",
    		  "lng": "126.937359341221"
    		 },
    		 {
    		  "address_code": 11590530,
    		  "address": "동작구 상도1동",
    		  "lat": "37.50324263284",
    		  "lng": "126.94974984805"
    		 },
    		 {
    		  "address_code": 11590540,
    		  "address": "동작구 상도2동",
    		  "lat": "37.505466519485",
    		  "lng": "126.942311042649"
    		 },
    		 {
    		  "address_code": 11590550,
    		  "address": "동작구 상도3동",
    		  "lat": "37.4992040702834",
    		  "lng": "126.931341762113"
    		 },
    		 {
    		  "address_code": 11590560,
    		  "address": "동작구 상도4동",
    		  "lat": "37.4993752739534",
    		  "lng": "126.941401972639"
    		 },
    		 {
    		  "address_code": 11590620,
    		  "address": "동작구 사당1동",
    		  "lat": "37.4830075809768",
    		  "lng": "126.978753012269"
    		 },
    		 {
    		  "address_code": 11590640,
    		  "address": "동작구 사당3동",
    		  "lat": "37.4866246436297",
    		  "lng": "126.972085412956"
    		 },
    		 {
    		  "address_code": 11590650,
    		  "address": "동작구 사당4동",
    		  "lat": "37.480958993413",
    		  "lng": "126.971630754658"
    		 },
    		 {
    		  "address_code": 11590651,
    		  "address": "동작구 사당5동",
    		  "lat": "37.4856250199803",
    		  "lng": "126.967015818218"
    		 },
    		 {
    		  "address_code": 11590660,
    		  "address": "동작구 대방동",
    		  "lat": "37.508164261",
    		  "lng": "126.926343500008"
    		 },
    		 {
    		  "address_code": 11590670,
    		  "address": "동작구 신대방1동",
    		  "lat": "37.4889471309298",
    		  "lng": "126.91004821119"
    		 },
    		 {
    		  "address_code": 11590680,
    		  "address": "동작구 신대방2동",
    		  "lat": "37.4984034227497",
    		  "lng": "126.924525599335"
    		 },
    		 {
    		  "address_code": 11590605,
    		  "address": "동작구 흑석동",
    		  "lat": "37.505775015354",
    		  "lng": "126.966590753167"
    		 },
    		 {
    		  "address_code": 11590510,
    		  "address": "동작구 노량진1동",
    		  "lat": "37.5123068024127",
    		  "lng": "126.942016221361"
    		 },
    		 {
    		  "address_code": 11590630,
    		  "address": "동작구 사당2동",
    		  "lat": "37.4887524986311",
    		  "lng": "126.979253427857"
    		 },
    		 {
    		  "address_code": 11620525,
    		  "address": "관악구 보라매동",
    		  "lat": "37.4881513476023",
    		  "lng": "126.932785628692"
    		 },
    		 {
    		  "address_code": 11620545,
    		  "address": "관악구 청림동",
    		  "lat": "37.491821317067",
    		  "lng": "126.958636328522"
    		 },
    		 {
    		  "address_code": 11620575,
    		  "address": "관악구 행운동",
    		  "lat": "37.4806158268211",
    		  "lng": "126.957086795114"
    		 },
    		 {
    		  "address_code": 11620585,
    		  "address": "관악구 낙성대동",
    		  "lat": "37.4762914533942",
    		  "lng": "126.95840521502"
    		 },
    		 {
    		  "address_code": 11620615,
    		  "address": "관악구 중앙동",
    		  "lat": "37.4841881538498",
    		  "lng": "126.949789748223"
    		 },
    		 {
    		  "address_code": 11620625,
    		  "address": "관악구 인헌동",
    		  "lat": "37.4751079563853",
    		  "lng": "126.965320137189"
    		 },
    		 {
    		  "address_code": 11620630,
    		  "address": "관악구 남현동",
    		  "lat": "37.474566758872",
    		  "lng": "126.977846469625"
    		 },
    		 {
    		  "address_code": 11620645,
    		  "address": "관악구 서원동",
    		  "lat": "37.4797639519189",
    		  "lng": "126.931377642121"
    		 },
    		 {
    		  "address_code": 11620655,
    		  "address": "관악구 신원동",
    		  "lat": "37.4815707566428",
    		  "lng": "126.927328376717"
    		 },
    		 {
    		  "address_code": 11620665,
    		  "address": "관악구 서림동",
    		  "lat": "37.4750122642948",
    		  "lng": "126.934981560611"
    		 },
    		 {
    		  "address_code": 11620685,
    		  "address": "관악구 신사동",
    		  "lat": "37.4829710818998",
    		  "lng": "126.919245211211"
    		 },
    		 {
    		  "address_code": 11620695,
    		  "address": "관악구 신림동",
    		  "lat": "37.4874127684412",
    		  "lng": "126.927123713685"
    		 },
    		 {
    		  "address_code": 11620715,
    		  "address": "관악구 난향동",
    		  "lat": "37.4615014997899",
    		  "lng": "126.918789051991"
    		 },
    		 {
    		  "address_code": 11620725,
    		  "address": "관악구 조원동",
    		  "lat": "37.4825122141627",
    		  "lng": "126.907817274289"
    		 },
    		 {
    		  "address_code": 11620735,
    		  "address": "관악구 대학동",
    		  "lat": "37.4706092043945",
    		  "lng": "126.936970450155"
    		 },
    		 {
    		  "address_code": 11620605,
    		  "address": "관악구 은천동",
    		  "lat": "37.4853777674734",
    		  "lng": "126.94250287828"
    		 },
    		 {
    		  "address_code": 11620565,
    		  "address": "관악구 성현동",
    		  "lat": "37.4895430309435",
    		  "lng": "126.948135286094"
    		 },
    		 {
    		  "address_code": 11620595,
    		  "address": "관악구 청룡동",
    		  "lat": "37.479095529182",
    		  "lng": "126.941675584432"
    		 },
    		 {
    		  "address_code": 11620775,
    		  "address": "관악구 난곡동",
    		  "lat": "37.4710253192116",
    		  "lng": "126.921654637868"
    		 },
    		 {
    		  "address_code": 11620745,
    		  "address": "관악구 삼성동",
    		  "lat": "37.4701456874833",
    		  "lng": "126.932973581898"
    		 },
    		 {
    		  "address_code": 11620765,
    		  "address": "관악구 미성동",
    		  "lat": "37.4762073455954",
    		  "lng": "126.915575982307"
    		 },
    		 {
    		  "address_code": 11650510,
    		  "address": "서초구 서초1동",
    		  "lat": "37.4901474659139",
    		  "lng": "127.019530273485"
    		 },
    		 {
    		  "address_code": 11650520,
    		  "address": "서초구 서초2동",
    		  "lat": "37.4921394474613",
    		  "lng": "127.025076125816"
    		 },
    		 {
    		  "address_code": 11650530,
    		  "address": "서초구 서초3동",
    		  "lat": "37.4837080639576",
    		  "lng": "127.01200750943"
    		 },
    		 {
    		  "address_code": 11650531,
    		  "address": "서초구 서초4동",
    		  "lat": "37.5026854085131",
    		  "lng": "127.022170883244"
    		 },
    		 {
    		  "address_code": 11650540,
    		  "address": "서초구 잠원동",
    		  "lat": "37.5149186880221",
    		  "lng": "127.014102820234"
    		 },
    		 {
    		  "address_code": 11650550,
    		  "address": "서초구 반포본동",
    		  "lat": "37.502124537535",
    		  "lng": "126.986921945669"
    		 },
    		 {
    		  "address_code": 11650560,
    		  "address": "서초구 반포1동",
    		  "lat": "37.5050906143733",
    		  "lng": "127.013377148581"
    		 },
    		 {
    		  "address_code": 11650570,
    		  "address": "서초구 반포2동",
    		  "lat": "37.5046371370118",
    		  "lng": "126.994498980616"
    		 },
    		 {
    		  "address_code": 11650580,
    		  "address": "서초구 반포3동",
    		  "lat": "37.5120469957586",
    		  "lng": "127.00561014665"
    		 },
    		 {
    		  "address_code": 11650581,
    		  "address": "서초구 반포4동",
    		  "lat": "37.4974688612419",
    		  "lng": "127.000307593388"
    		 },
    		 {
    		  "address_code": 11650590,
    		  "address": "서초구 방배본동",
    		  "lat": "37.4942175065079",
    		  "lng": "126.988886408987"
    		 },
    		 {
    		  "address_code": 11650600,
    		  "address": "서초구 방배1동",
    		  "lat": "37.4833697664522",
    		  "lng": "126.994491495079"
    		 },
    		 {
    		  "address_code": 11650610,
    		  "address": "서초구 방배2동",
    		  "lat": "37.4797829991168",
    		  "lng": "126.985578175304"
    		 },
    		 {
    		  "address_code": 11650620,
    		  "address": "서초구 방배3동",
    		  "lat": "37.4784215531775",
    		  "lng": "126.999995477716"
    		 },
    		 {
    		  "address_code": 11650621,
    		  "address": "서초구 방배4동",
    		  "lat": "37.4890604237231",
    		  "lng": "126.992482898494"
    		 },
    		 {
    		  "address_code": 11650651,
    		  "address": "서초구 양재1동",
    		  "lat": "37.4716393313204",
    		  "lng": "127.026728803944"
    		 },
    		 {
    		  "address_code": 11650652,
    		  "address": "서초구 양재2동",
    		  "lat": "37.4706332171867",
    		  "lng": "127.041288687936"
    		 },
    		 {
    		  "address_code": 11650660,
    		  "address": "서초구 내곡동",
    		  "lat": "37.4582463131039",
    		  "lng": "127.076916934729"
    		 },
    		 {
    		  "address_code": 11680510,
    		  "address": "강남구 신사동",
    		  "lat": "37.5239850298543",
    		  "lng": "127.02277448907"
    		 },
    		 {
    		  "address_code": 11680521,
    		  "address": "강남구 논현1동",
    		  "lat": "37.511470639272",
    		  "lng": "127.028552712008"
    		 },
    		 {
    		  "address_code": 11680531,
    		  "address": "강남구 논현2동",
    		  "lat": "37.5173931863142",
    		  "lng": "127.037350857638"
    		 },
    		 {
    		  "address_code": 11680580,
    		  "address": "강남구 삼성1동",
    		  "lat": "37.5143912094485",
    		  "lng": "127.062527941715"
    		 },
    		 {
    		  "address_code": 11680590,
    		  "address": "강남구 삼성2동",
    		  "lat": "37.5112632807882",
    		  "lng": "127.046070584216"
    		 },
    		 {
    		  "address_code": 11680600,
    		  "address": "강남구 대치1동",
    		  "lat": "37.4932601098363",
    		  "lng": "127.05682016381"
    		 },
    		 {
    		  "address_code": 11680630,
    		  "address": "강남구 대치4동",
    		  "lat": "37.4997288869798",
    		  "lng": "127.057747872925"
    		 },
    		 {
    		  "address_code": 11680640,
    		  "address": "강남구 역삼1동",
    		  "lat": "37.4954171091244",
    		  "lng": "127.033201083326"
    		 },
    		 {
    		  "address_code": 11680650,
    		  "address": "강남구 역삼2동",
    		  "lat": "37.4959639052057",
    		  "lng": "127.046839198832"
    		 },
    		 {
    		  "address_code": 11680655,
    		  "address": "강남구 도곡1동",
    		  "lat": "37.4883045975414",
    		  "lng": "127.03896912922"
    		 },
    		 {
    		  "address_code": 11680656,
    		  "address": "강남구 도곡2동",
    		  "lat": "37.4837284016542",
    		  "lng": "127.046383821773"
    		 },
    		 {
    		  "address_code": 11680660,
    		  "address": "강남구 개포1동",
    		  "lat": "37.48197916687",
    		  "lng": "127.057489994874"
    		 },
    		 {
    		  "address_code": 11680690,
    		  "address": "강남구 개포4동",
    		  "lat": "37.4788499689324",
    		  "lng": "127.051622162647"
    		 },
    		 {
    		  "address_code": 11680720,
    		  "address": "강남구 일원본동",
    		  "lat": "37.4833130035406",
    		  "lng": "127.086498830032"
    		 },
    		 {
    		  "address_code": 11680730,
    		  "address": "강남구 일원1동",
    		  "lat": "37.4918786250766",
    		  "lng": "127.088069174192"
    		 },
    		 {
    		  "address_code": 11680740,
    		  "address": "강남구 일원2동",
    		  "lat": "37.492173181316",
    		  "lng": "127.073699594468"
    		 },
    		 {
    		  "address_code": 11680750,
    		  "address": "강남구 수서동",
    		  "lat": "37.4888878594165",
    		  "lng": "127.105003972121"
    		 },
    		 {
    		  "address_code": 11680700,
    		  "address": "강남구 세곡동",
    		  "lat": "37.4644437055763",
    		  "lng": "127.106760267266"
    		 },
    		 {
    		  "address_code": 11680545,
    		  "address": "강남구 압구정동",
    		  "lat": "37.5306686414269",
    		  "lng": "127.030809170421"
    		 },
    		 {
    		  "address_code": 11680565,
    		  "address": "강남구 청담동",
    		  "lat": "37.5250293348774",
    		  "lng": "127.049233039691"
    		 },
    		 {
    		  "address_code": 11680610,
    		  "address": "강남구 대치2동",
    		  "lat": "37.5022592044328",
    		  "lng": "127.064164457307"
    		 },
    		 {
    		  "address_code": 11680670,
    		  "address": "강남구 개포2동",
    		  "lat": "37.4898261143433",
    		  "lng": "127.069133611378"
    		 },
    		 {
    		  "address_code": 11710510,
    		  "address": "송파구 풍납1동",
    		  "lat": "37.5380806562923",
    		  "lng": "127.122081178204"
    		 },
    		 {
    		  "address_code": 11710520,
    		  "address": "송파구 풍납2동",
    		  "lat": "37.529239225114",
    		  "lng": "127.115731280691"
    		 },
    		 {
    		  "address_code": 11710531,
    		  "address": "송파구 거여1동",
    		  "lat": "37.496978340831",
    		  "lng": "127.143265167646"
    		 },
    		 {
    		  "address_code": 11710532,
    		  "address": "송파구 거여2동",
    		  "lat": "37.4935212106896",
    		  "lng": "127.146908778436"
    		 },
    		 {
    		  "address_code": 11710540,
    		  "address": "송파구 마천1동",
    		  "lat": "37.4960185554886",
    		  "lng": "127.149971448599"
    		 },
    		 {
    		  "address_code": 11710550,
    		  "address": "송파구 마천2동",
    		  "lat": "37.4968492847332",
    		  "lng": "127.14854371836"
    		 },
    		 {
    		  "address_code": 11710561,
    		  "address": "송파구 방이1동",
    		  "lat": "37.5109802110576",
    		  "lng": "127.123919111742"
    		 },
    		 {
    		  "address_code": 11710562,
    		  "address": "송파구 방이2동",
    		  "lat": "37.5163879637606",
    		  "lng": "127.111322597288"
    		 },
    		 {
    		  "address_code": 11710566,
    		  "address": "송파구 오륜동",
    		  "lat": "37.5154162110562",
    		  "lng": "127.134305677243"
    		 },
    		 {
    		  "address_code": 11710570,
    		  "address": "송파구 오금동",
    		  "lat": "37.5029748269765",
    		  "lng": "127.128103930329"
    		 },
    		 {
    		  "address_code": 11710580,
    		  "address": "송파구 송파1동",
    		  "lat": "37.5062229082525",
    		  "lng": "127.109316959721"
    		 },
    		 {
    		  "address_code": 11710590,
    		  "address": "송파구 송파2동",
    		  "lat": "37.5023378540008",
    		  "lng": "127.116766391715"
    		 },
    		 {
    		  "address_code": 11710600,
    		  "address": "송파구 석촌동",
    		  "lat": "37.5035646306704",
    		  "lng": "127.103667384036"
    		 },
    		 {
    		  "address_code": 11710610,
    		  "address": "송파구 삼전동",
    		  "lat": "37.5027233386059",
    		  "lng": "127.092519707191"
    		 },
    		 {
    		  "address_code": 11710620,
    		  "address": "송파구 가락본동",
    		  "lat": "37.495586073466",
    		  "lng": "127.121767713047"
    		 },
    		 {
    		  "address_code": 11710631,
    		  "address": "송파구 가락1동",
    		  "lat": "37.4965023622768",
    		  "lng": "127.109854640362"
    		 },
    		 {
    		  "address_code": 11710632,
    		  "address": "송파구 가락2동",
    		  "lat": "37.4986984316408",
    		  "lng": "127.126640056537"
    		 },
    		 {
    		  "address_code": 11710641,
    		  "address": "송파구 문정1동",
    		  "lat": "37.4901342707731",
    		  "lng": "127.124183183715"
    		 },
    		 {
    		  "address_code": 11710642,
    		  "address": "송파구 문정2동",
    		  "lat": "37.4898951926479",
    		  "lng": "127.110912385336"
    		 },
    		 {
    		  "address_code": 11710650,
    		  "address": "송파구 잠실본동",
    		  "lat": "37.5060603472209",
    		  "lng": "127.083254253495"
    		 },
    		 {
    		  "address_code": 11710690,
    		  "address": "송파구 잠실4동",
    		  "lat": "37.5202361905209",
    		  "lng": "127.112228750219"
    		 },
    		 {
    		  "address_code": 11710710,
    		  "address": "송파구 잠실6동",
    		  "lat": "37.5181274574866",
    		  "lng": "127.100660517951"
    		 },
    		 {
    		  "address_code": 11710720,
    		  "address": "송파구 잠실7동",
    		  "lat": "37.5086703158759",
    		  "lng": "127.076968643544"
    		 },
    		 {
    		  "address_code": 11710670,
    		  "address": "송파구 잠실2동",
    		  "lat": "37.5119166362263",
    		  "lng": "127.088540619051"
    		 },
    		 {
    		  "address_code": 11710680,
    		  "address": "송파구 잠실3동",
    		  "lat": "37.5133248862519",
    		  "lng": "127.094383266833"
    		 },
    		 {
    		  "address_code": 11710646,
    		  "address": "송파구 장지동",
    		  "lat": "37.4785083981104",
    		  "lng": "127.136582139995"
    		 },
    		 {
    		  "address_code": 11710647,
    		  "address": "송파구 위례동",
    		  "lat": "37.4811482419833",
    		  "lng": "127.144257010883"
    		 },
    		 {
    		  "address_code": 11740515,
    		  "address": "강동구 강일동",
    		  "lat": "37.5650420192005",
    		  "lng": "127.173906305383"
    		 },
    		 {
    		  "address_code": 11740520,
    		  "address": "강동구 상일동",
    		  "lat": "37.5505837474646",
    		  "lng": "127.168300419218"
    		 },
    		 {
    		  "address_code": 11740530,
    		  "address": "강동구 명일1동",
    		  "lat": "37.5512605741445",
    		  "lng": "127.144346767847"
    		 },
    		 {
    		  "address_code": 11740540,
    		  "address": "강동구 명일2동",
    		  "lat": "37.5463359336275",
    		  "lng": "127.151371265101"
    		 },
    		 {
    		  "address_code": 11740550,
    		  "address": "강동구 고덕1동",
    		  "lat": "37.5572594640654",
    		  "lng": "127.151497480999"
    		 },
    		 {
    		  "address_code": 11740560,
    		  "address": "강동구 고덕2동",
    		  "lat": "37.5605254810662",
    		  "lng": "127.164365974379"
    		 },
    		 {
    		  "address_code": 11740580,
    		  "address": "강동구 암사2동",
    		  "lat": "37.5517487650624",
    		  "lng": "127.127241282337"
    		 },
    		 {
    		  "address_code": 11740590,
    		  "address": "강동구 암사3동",
    		  "lat": "37.5549733882203",
    		  "lng": "127.140777676291"
    		 },
    		 {
    		  "address_code": 11740600,
    		  "address": "강동구 천호1동",
    		  "lat": "37.5449553397917",
    		  "lng": "127.136820957834"
    		 },
    		 {
    		  "address_code": 11740620,
    		  "address": "강동구 천호3동",
    		  "lat": "37.5361009389327",
    		  "lng": "127.133125335126"
    		 },
    		 {
    		  "address_code": 11740640,
    		  "address": "강동구 성내1동",
    		  "lat": "37.530479464765",
    		  "lng": "127.122421771231"
    		 },
    		 {
    		  "address_code": 11740650,
    		  "address": "강동구 성내2동",
    		  "lat": "37.5324396381608",
    		  "lng": "127.129557226962"
    		 },
    		 {
    		  "address_code": 11740660,
    		  "address": "강동구 성내3동",
    		  "lat": "37.526056837224",
    		  "lng": "127.13289932744"
    		 },
    		 {
    		  "address_code": 11740690,
    		  "address": "강동구 둔촌1동",
    		  "lat": "37.5235007993257",
    		  "lng": "127.13675461842"
    		 },
    		 {
    		  "address_code": 11740700,
    		  "address": "강동구 둔촌2동",
    		  "lat": "37.5333480007967",
    		  "lng": "127.141963454031"
    		 },
    		 {
    		  "address_code": 11740570,
    		  "address": "강동구 암사1동",
    		  "lat": "37.5515625771128",
    		  "lng": "127.132682054831"
    		 },
    		 {
    		  "address_code": 11740610,
    		  "address": "강동구 천호2동",
    		  "lat": "37.5434507065521",
    		  "lng": "127.125430274302"
    		 },
    		 {
    		  "address_code": 11740685,
    		  "address": "강동구 길동",
    		  "lat": "37.5344859624471",
    		  "lng": "127.142712345548"
    		 }
    		]};
	var markers = [];
	var code = [];
    

    var imageSrc = 'https://cdn.pixabay.com/photo/2017/09/29/00/30/checkmark-icon-2797531_1280.png',
	imageSize = new kakao.maps.Size(20, 20), // 마커이미지의 크기입니다
    imageOption = {offset: new kakao.maps.Point(15, 69)}; // 마커이미지의 옵션입니다. 마커의 좌표와 일치시킬 이미지 안에서의 좌표를 설정합니다.

   		
    
    for(var n = 0; n < data.positions.length; n++){
    	code[n] = data.positions[n].address_code;
    };
    
		for(var n = 0; n < data.positions.length; n++) {
			   var markerPosition  = new kakao.maps.LatLng(data.positions[n].lat,data.positions[n].lng);
			   //console.log(markerPosition);
			   var markerImage = new kakao.maps.MarkerImage(imageSrc, imageSize, imageOption);
			   var marker	= new kakao.maps.Marker({
					position: markerPosition,
					map: map,
					clickable: true,
					image : markerImage
				});
			
			   var iwRemoveable = true;
			// 인포윈도우를 생성합니다
			    var infowindow = new kakao.maps.InfoWindow({
			    	removable : true, 
			    	position : markerPosition,
			        content : '<a href=\"#\" onclick=window.open(\"/bigdata/getChart?code='+code[n]+'\")  style=\"color:black\" class="info-title"><h5>' + data.positions[n].address+' 생활인구</h5></a>'
			    });
				
			//console.log(infowindow.cc.split('[')[1].split(']')[0]);
			    markers.push(marker);
			    kakao.maps.event.addListener(marker,'mouseover',makeClick(map, marker, infowindow));
			    kakao.maps.event.addListener(marker,'mouseout',infoOut(map, marker,infowindow));
			    kakao.maps.event.addListener(marker, 'click', function() {
			  
			    //window.open("/bigdata/getChart?code="+marker.Gb,"상세페이지","width=700,height=1500,left=100,top=50"); 
			  });
		}
			clusterer.addMarkers(markers);

    kakao.maps.event.addListener(clusterer, 'clusterclick', function(cluster) {
        // 현재 지도 레벨에서 1레벨 확대한 레벨
        var level = map.getLevel()-1;
        // 지도를 클릭된 클러스터의 마커의 위치를 기준으로 확대합니다
        map.setLevel(level, {anchor: cluster.getCenter()});
    });
 
    function makeClick(map, marker, infowindow){
        return function(){
            infowindow.open(map, marker);
        };
    };   
    
    function infoOut(map, marker, infowindow){
        return function(){
            //infowindow.close();
        };
    };   
</script>

</body>
<%@ include file="../../main/Footer.jsp"%>
</html>